<a href="https://colab.research.google.com/github/grbarbosa3/data_science/blob/master/Loc_index_examples.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt

%matplotlib inline

In [10]:
df_planets = pd.read_csv("/content/Planets.xlsx - Export.csv")

In [11]:
df_planets

    Planet       Mass Diameter  ...  MagneticField  FirstVisited  FirstMission
0  MERCURY     0.3300     4879  ...            Yes    1974-03-29    Mariner 10
1    VENUS     4.8700   12,104  ...             No    1962-08-27     Mariner 2
2    EARTH     5.9700   12,756  ...            Yes           NaN           NaN
3     MOON     0.0730     3475  ...             No    1959-09-12        Luna 2
4     MARS     0.6420     6792  ...             No    1965-07-15     Mariner 4
5  JUPITER  1898.0000  142,984  ...            Yes    1973-12-04    Pioneer 10
6   SATURN   568.0000  120,536  ...            Yes    1979-09-01    Pioneer 11
7   URANUS    86.8000   51,118  ...            Yes    1986-01-24     Voyager 2
8  NEPTUNE   102.0000   49,528  ...            Yes    1989-08-25     Voyager 2
9    PLUTO     0.0146     2370  ...            NaN    2015-07-14  New Horizons

[10 rows x 14 columns]

In [7]:
planets_clean = pd.read_csv("/content/Planets.xlsx - Export.csv",usecols=[0,1,2,3])

In [8]:
planets_clean

    Planet       Mass Diameter  DayLength
0  MERCURY     0.3300     4879     4222.6
1    VENUS     4.8700   12,104     2802.0
2    EARTH     5.9700   12,756       24.0
3     MOON     0.0730     3475      708.7
4     MARS     0.6420     6792       24.7
5  JUPITER  1898.0000  142,984        9.9
6   SATURN   568.0000  120,536       10.7
7   URANUS    86.8000   51,118       17.2
8  NEPTUNE   102.0000   49,528       16.1
9    PLUTO     0.0146     2370      153.3

In [12]:
planets_clean["Mass"]

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

In [13]:
planets_clean.Mass

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

In [14]:
planets_clean.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
planets_clean.loc[0]

Planet       MERCURY
Mass            0.33
Diameter        4879
DayLength     4222.6
Name: 0, dtype: object

In [16]:
planets_clean.loc[5]

Planet       JUPITER
Mass            1898
Diameter     142,984
DayLength        9.9
Name: 5, dtype: object

In [17]:
df_planets.loc[5]

Planet                JUPITER
Mass                     1898
Diameter              142,984
DayLength                 9.9
SunDistance             778.6
OrbitPeriod              4331
OrbitVelocity            13.1
MeanTemperature          -110
SurfacePressure           NaN
Moons                      67
Rings                     Yes
MagneticField             Yes
FirstVisited       1973-12-04
FirstMission       Pioneer 10
Name: 5, dtype: object

In [27]:
planets_clean

              Mass Diameter  DayLength
Planet
MERCURY     0.3300     4879     4222.6
VENUS       4.8700   12,104     2802.0
EARTH       5.9700   12,756       24.0
MOON        0.0730     3475      708.7
MARS        0.6420     6792       24.7
JUPITER  1898.0000  142,984        9.9
SATURN    568.0000  120,536       10.7
URANUS     86.8000   51,118       17.2
NEPTUNE   102.0000   49,528       16.1
PLUTO       0.0146     2370      153.3

In [31]:
planets_clean.loc["MERCURY":"JUPITER"]

             Mass Diameter  DayLength
Planet
MERCURY     0.330     4879     4222.6
VENUS       4.870   12,104     2802.0
EARTH       5.970   12,756       24.0
MOON        0.073     3475      708.7
MARS        0.642     6792       24.7
JUPITER  1898.000  142,984        9.9

In [30]:
planets_clean.columns

Index(['Mass', 'Diameter', 'DayLength'], dtype='object')

AttributeError: ignored

In [34]:
df_planets.loc[0].FirstVisited

'1974-03-29'